import json

DATABASE = "recipes.db"
CATEGORIES = ["Κρεατικά", "Ζυμαρικά/Ρύζι", "Μαγειρευτά", "Ψάρι/θαλασσινά", "Σαλάτες", "Ορεκτικά", "Έθνικ"]
DIFFICULTY_OPTIONS = ["Εύκολο", "Μέτριας δυσκολίας", "Δύσκολο"]



# Δοκιμαστικά βήματα συνταγής
test_steps = json.dumps([
    {"description": "Βραζουμε τα μακαρονια σε νερο", "time": "120"},
    {"description": "Ετοιμαζουμε την σαλτσα με τοματα, βασιλικό και σκόρδο.", "time": "120"},
    {"description": "Ανακατεύουμε τα μακαρονια με την σάλτσα και τα σερβίρουμε στα πιάτα.", "time": "20"}
])